app/Controllers/BahanBaku.php

    public function index()
    {
        if (session()->get('user_role') !== 'gudang') {
            return redirect()->to('/dashboard');
        }

        $bahanBakuModel = new BahanBakuModel();

        $data = [
            'title' => 'Daftar Bahan Baku',
            'bahan_baku' => $bahanBakuModel->findAll()
---
SELECT *
FROM `bahan_baku`