app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `email` = 'budi.gudang@mbg.id'
 LIMIT 1
---
    public function process()
    {
        $session = session();
        $userModel = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();