app/Controllers/Permintaan.php

INSERT INTO `permintaan` (`pemohon_id`, `tgl_masak`, `menu_makan`, `jumlah_porsi`, `status`, `created_at`) VALUES ('6', '2025-10-04', 'Semur tongkol', '90', 'menunggu', '2025-10-03 15:42:51')
INSERT INTO `permintaan_detail` (`permintaan_id`, `bahan_id`, `jumlah_diminta`) VALUES (12, '14', '50')
---
    public function store()
    {
        if (session()->get('user_role') !== 'dapur') {
            return redirect()->to('/dashboard');
        }

        $permintaanModel = new PermintaanModel();
        $detailPermintaanModel = new \App\Models\PermintaanDetailModel();

        $dataPermintaan = [
            'pemohon_id'    => session()->get('user_id'),
            'tgl_masak'     => $this->request->getPost('tgl_masak'),
            'menu_makan'    => $this->request->getPost('menu_makan'),
            'jumlah_porsi'  => $this->request->getPost('jumlah_porsi'),
            'status'        => 'menunggu',
            'created_at'    => date('Y-m-d H:i:s')
        ];

        $permintaanModel->insert($dataPermintaan);
        $permintaanID = $permintaanModel->getInsertID();

        $bahanIDs = $this->request->getPost('bahan_id');
        $jumlahs = $this->request->getPost('jumlah');

        foreach ($bahanIDs as $index => $bahanID) {
            $dataDetail = [
                'permintaan_id'  => $permintaanID,
                'bahan_id'       => $bahanID,
                'jumlah_diminta' => $jumlahs[$index]
            ];
            $detailPermintaanModel->insert($dataDetail);