app/Models/BahanBakuModel.php

    public function getAllWithDynamicStatus()
    {
        $semuaBahan = $this->findAll();
---
SELECT *
FROM `bahan_baku`